# PANDAS SERIES

In [2]:
import numpy as np
import pandas as pd

In [6]:
labels = ['a', 'b', 'c']
num_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10,'b':20,'c':30}

In [13]:
pd.Series(data=num_list)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data=num_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
salesQ1 = pd.Series(data=[250,450,200,150], index=['USA', 'China', 'India', 'Brazil'])

In [17]:
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [18]:
salesQ2 = pd.Series(data=[260,500,210,100], index=['USA', 'China', 'India', 'Japan'])

In [20]:
salesQ2['China']

500

In [24]:
salesQ2[1]

500

In [25]:
salesQ1 + salesQ2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

# PANDAS DATAFRAMES - PART 1

In [41]:
columns = ['W','X','Y','Z']

In [40]:
index = ['A','B','C','D','E']

In [9]:
np.random.seed(42)
data = np.random.randint(-100, 100, (5, 4))

In [10]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [42]:
df = pd.DataFrame(data, index, columns)

In [38]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [41]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [40]:
type(df['W'])

pandas.core.series.Series

In [42]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [44]:
df['new'] = df['W'] + df['Y']

In [45]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [47]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [48]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [49]:
df.drop('E', axis=0)

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19

In [50]:
df.loc['A']

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [51]:
df.loc[['A','E']]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
E  30  49 -48 -99  -18

In [52]:
df.iloc[0]

W       2
X      79
Y      -8
Z     -86
new    -6
Name: A, dtype: int64

In [53]:
df.iloc[[0, -1]]

    W   X   Y   Z  new
A   2  79  -8 -86   -6
E  30  49 -48 -99  -18

In [11]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

# PANDAS DATAFRAMES - PART 2

In [12]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [13]:
df[df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [14]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [16]:
df[df['X'] > 0]

A     2
C     2
E    30
Name: W, dtype: int64

In [17]:
df[df['X'] > 0]['W']

A     2
C     2
E    30
Name: W, dtype: int64

In [19]:
df[df['X'] > 0].iloc[1]

W     2
X    21
Y   -26
Z   -13
Name: C, dtype: int64

In [22]:
(df['W'] > 0) & (df['Y'] > 1)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [25]:
(df['W'] < 0) | (df['Y'] > 1)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [26]:
df[(df['W'] > 0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [27]:
df[(df['W'] < 0) | (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [29]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [30]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [31]:
new_indx = ['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
df['States'] = new_indx

In [45]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [46]:
df = df.set_index('States')

In [47]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [48]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [50]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

# PANDAS MISSING DATA

In [20]:
df = pd.DataFrame({'A':[1,2,np.nan, 4], 'B':[5,np.nan, np.nan,8], 'C':[10, 20, 30, 40]})

In [3]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [4]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [8]:
df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [10]:
df.dtypes

A    float64
B    float64
C      int64
dtype: object

In [11]:
df.fillna(value='FILL VALUE')

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [12]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [13]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [15]:
df['A'] = df['A'].fillna(value=0)

In [16]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [18]:
df['B'].fillna(value = df['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [21]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

# GROUPBY OPERATIONS

In [22]:
df = pd.read_csv('Universities.csv')

In [23]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [25]:
df.groupby('Year')

In [26]:
df.groupby('Year').sum()

      Completions
Year
2012        20333
2013        21046
2014        24730
2015        26279
2016        26224

In [30]:
df.groupby('Year').mean().sort_index(ascending=False)

      Completions
Year
2016   609.860465
2015   597.250000
2014   588.809524
2013   526.150000
2012   535.078947

In [28]:
type(df.groupby('Year').mean())

pandas.core.frame.DataFrame

In [32]:
df.groupby(['Year', 'Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [33]:
df.groupby('Year').describe()

     Completions
           count        mean          std   min     25%    50%     75%     max
Year
2012        38.0  535.078947  1036.433239  13.0  114.25  229.5  420.50  5388.0
2013        40.0  526.150000  1040.474782   0.0   98.50  189.0  413.00  5278.0
2014        42.0  588.809524  1150.355857   0.0  104.50  203.5  371.75  5093.0
2015        44.0  597.250000  1183.371791   0.0   87.75  191.0  405.75  5335.0
2016        43.0  609.860465  1235.952796   0.0   90.00  208.0  414.00  5367.0

In [34]:
df.groupby('Year').describe().transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

# PANDAS OPERATIONS

In [35]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'], 'col1': [100,200,300,300,400,500], 'col2':['NY','CA','WA','WA','AK','NV']})

In [36]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [37]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [38]:
df_one['col1'].unique()

array([100, 200, 300, 400, 500])

In [39]:
df_one['col2'].nunique()

5

In [41]:
df_one['col1'].value_counts()

300    2
100    1
400    1
500    1
200    1
Name: col1, dtype: int64

In [43]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [44]:
df_one['NEW'] = df_one['col1'] * 10

In [45]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [46]:
def get_first_letter(state):
    return state[0]

In [48]:
df_one['first letter'] = df_one['col2'].apply(get_first_letter)

In [49]:
df_one

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [56]:
def get_complex_letter(state):
    if type(state) == str:
        if state[0] == "W":
            return "Washington"
        else:
            return "Error"
    else:
        return state

In [58]:
df_one['col2'].apply(get_complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [57]:
df_one['col1'].apply(get_complex_letter)

0    100
1    200
2    300
3    300
4    400
5    500
Name: col1, dtype: int64

In [59]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [60]:
df_map = {'A': 1, 'B': 2, 'C': 3}

In [61]:
df_one['num'] = df_one['k1'].map(df_map)

In [62]:
df_one

  k1  col1 col2   NEW first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [63]:
df_one['col1'].max()

500

In [64]:
df_one['col1'].idxmax()

5

In [65]:
df_one['col1'].idxmin()

0

In [66]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'first letter', 'num'], dtype='object')

In [67]:
df_one.columns = ['C1', 'C2', 'C3', 'C4', 'C5', 'C6']

In [70]:
df_one.sort_values('C3', ascending=False)

  C1   C2  C3    C4 C5  C6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [72]:
features = pd.DataFrame({'A':[100,200,300,400,500], 'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [73]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [74]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [75]:
pd.concat([features, predictions])

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       A     B  pred
0  100.0  12.0   NaN
1  200.0  13.0   NaN
2  300.0  14.0   NaN
3  400.0  15.0   NaN
4  500.0  16.0   NaN
0    NaN   NaN   0.0
1    NaN   NaN   1.0
2    NaN   NaN   1.0
3    NaN   NaN   0.0
4    NaN   NaN   1.0

In [76]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [78]:
df_one['C1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [79]:
pd.get_dummies(df_one['C1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

# DATA INPUT AND OUTPUT

In [80]:
df = pd.read_csv('example.csv')

In [82]:
pwd

'/Users/konraduciechowski/tensorflow-course'

In [83]:
ls

Excel_Sample.xlsx                    example.csv
README.md                            machine_learning_concepts.ipynb
Universities.csv                     numpy_crash_course.ipynb
african_econ_crises.csv              output.csv
artificial_neural_networks.ipynb     pandas_crash_course.ipynb
bank.csv                             recurrent_neural_networks.ipynb
convolutional_neural_networks.ipynb  visualisation_crash_course.ipynb

In [88]:
df.to_csv('output.csv', index=True)

In [91]:
pd.read_csv('output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [ ]:
tables = pd.read_html('http://ww.fdic.gov/bank/individual/failed/banklist.html')

# PANDAS EXERCISES

In [ ]:
# TODO